# R sqldf Package

## 1. "sqldf" Package

### 1) Install "sqldf" Package

In [1]:
devtools::install_github("ggrothendieck/sqldf")

Downloading GitHub repo ggrothendieck/sqldf@HEAD

bit     (4.0.4 -> 4.0.5 ) [CRAN]
plogr   (NA    -> 0.2.0 ) [CRAN]
proto   (NA    -> 1.0.0 ) [CRAN]
chron   (NA    -> 2.3-61) [CRAN]
RSQLite (NA    -> 2.3.1 ) [CRAN]
gsubfn  (NA    -> 0.7   ) [CRAN]

Installing 6 packages: bit, plogr, proto, chron, RSQLite, gsubfn

Installing packages into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

── R CMD build ─────────────────────────────────────────────────────────────────
* checking for file ‘/tmp/RtmpCqf4cQ/remotes1d73481a779/ggrothendieck-sqldf-ba33807/DESCRIPTION’ ... OK
* preparing ‘sqldf’:
* checking DESCRIPTION meta-information ... OK
* checking for LF line-endings in source and make files and shell scripts
* checking for empty or unneeded directories
* building ‘sqldf_0.4-11.tar.gz’

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

### 2) Installed Packages

In [2]:
library()

### 3) Import "sqldf" Package

In [4]:
library(sqldf)

Loading required package: gsubfn

Loading required package: proto

Warning message:
“no DISPLAY variable so Tk is not available”
Loading required package: RSQLite

## 2. Load Data

* read.csv()

In [5]:
url = 'https://raw.githubusercontent.com/rusita-ai/pyData/master/PII.csv'

TB <- read.csv(url)

* str()

In [7]:
str(TB)

'data.frame':	17 obs. of  8 variables:
 $ Name     : chr  "송태섭" "최유정" "이한나" "김소혜" ...
 $ Gender   : chr  "남자" "여자" "여자" "여자" ...
 $ Age      : int  21 23 20 23 24 24 22 22 23 22 ...
 $ Grade    : int  3 1 1 3 4 2 4 2 3 2 ...
 $ Picture  : chr  "무" "유" "무" "무" ...
 $ BloodType: chr  "B" "A" "A" "O" ...
 $ Height   : num  179 177 168 176 176 ...
 $ Weight   : num  63.9 54.9 50.2 53.5 79.8 61.7 69.8 52.7 68.5 52.3 ...

* head()

In [8]:
head(TB, 5)

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 이한나 여자   20  1     무      A         167.9  50.2
4 김소혜 여자   23  3     무      O         176.1  53.5
5 서태웅 남자   24  4     무      B         176.1  79.8

## 3. SQL 수행

### 1) "SELECT * FROM Table_Name"

In [9]:
sqldf("SELECT Height FROM TB")

   Height
1  179.1
2  177.1
3  167.9
4  176.1
5  176.1
6  175.2
7  169.1
8  169.9
9  165.5
10 161.9
11 163.2
12 157.8
13 166.9
14 181.8
15 180.3
16 155.5
17 168.9

* import "dplyr" Package

In [10]:
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [11]:
sqldf("SELECT Gender, Height FROM TB") %>% head(3)

  Gender Height
1 남자   179.1
2 여자   177.1
3 여자   167.9

In [12]:
sqldf("SELECT Name, Height FROM TB") %>% head(3)

  Name   Height
1 송태섭 179.1
2 최유정 177.1
3 이한나 167.9

In [13]:
sqldf("SELECT Gender, Height, BloodType FROM TB") %>% head(3)

  Gender Height BloodType
1 남자   179.1  B
2 여자   177.1  A
3 여자   167.9  A

In [14]:
sqldf("SELECT * FROM TB") %>% head(3)

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 이한나 여자   20  1     무      A         167.9  50.2

### 2) "WHERE" 조건구문

In [15]:
sqldf("SELECT * FROM TB WHERE Height > 175")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 김소혜 여자   23  3     무      O         176.1  53.5
4 서태웅 남자   24  4     무      B         176.1  79.8
5 정대만 남자   24  2     유      B         175.2  61.7
6 채치수 남자   23  3     무      AB        181.8  85.9
7 윤대협 남자   22  2     유      AB        180.3  76.2

#### (1) " AND" 연산

In [16]:
sqldf("SELECT * FROM TB WHERE Height > 175 AND Weight < 75")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 김소혜 여자   23  3     무      O         176.1  53.5
4 정대만 남자   24  2     유      B         175.2  61.7

In [17]:
sqldf("SELECT * FROM TB WHERE Height > 175 AND Grade = 3")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 김소혜 여자   23  3     무      O         176.1  53.5
3 채치수 남자   23  3     무      AB        181.8  85.9

#### (2) "OR" 연산

In [18]:
sqldf("SELECT * FROM TB WHERE Height > 175 OR Grade = 3")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 김소혜 여자   23  3     무      O         176.1  53.5
4 서태웅 남자   24  4     무      B         176.1  79.8
5 정대만 남자   24  2     유      B         175.2  61.7
6 강백호 남자   23  3     무      O         165.5  68.5
7 채치수 남자   23  3     무      AB        181.8  85.9
8 윤대협 남자   22  2     유      AB        180.3  76.2

In [19]:
sqldf("SELECT * FROM TB WHERE Height > 175 OR Age = 24")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 김소혜 여자   23  3     무      O         176.1  53.5
4 서태웅 남자   24  4     무      B         176.1  79.8
5 정대만 남자   24  2     유      B         175.2  61.7
6 권준호 남자   24  4     유      O         166.9  61.7
7 채치수 남자   23  3     무      AB        181.8  85.9
8 윤대협 남자   22  2     유      AB        180.3  76.2

### 3) 명목형 연산

In [20]:
sqldf("SELECT * FROM TB WHERE Name = '강백호'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 강백호 남자   23  3     무      O         165.5  68.5

In [21]:
sqldf("SELECT * FROM TB WHERE BloodType = 'B'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 서태웅 남자   24  4     무      B         176.1  79.8
3 정대만 남자   24  2     유      B         175.2  61.7
4 이정환 남자   22  4     무      B         169.1  69.8
5 정채연 여자   22  2     무      B         157.8  44.9

In [22]:
sqldf("SELECT * FROM TB WHERE Height > 175 AND BloodType = 'B'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 서태웅 남자   24  4     무      B         176.1  79.8
3 정대만 남자   24  2     유      B         175.2  61.7

### 4) "IN" 연산자

In [23]:
sqldf("SELECT * FROM TB WHERE Grade IN ('2', '4')")

  Name   Gender Age Grade Picture BloodType Height Weight
1 서태웅 남자   24  4     무      B         176.1  79.8
2 정대만 남자   24  2     유      B         175.2  61.7
3 이정환 남자   22  4     무      B         169.1  69.8
4 채소연 여자   22  2     유      AB        169.9  52.7
5 전소미 여자   22  2     유      O         161.9  52.3
6 정채연 여자   22  2     무      B         157.8  44.9
7 권준호 남자   24  4     유      O         166.9  61.7
8 윤대협 남자   22  2     유      AB        180.3  76.2

In [24]:
sqldf("SELECT * FROM TB WHERE BloodType IN ('A', 'B', 'O')")

   Name   Gender Age Grade Picture BloodType Height Weight
1  송태섭 남자   21  3     무      B         179.1  63.9
2  최유정 여자   23  1     유      A         177.1  54.9
3  이한나 여자   20  1     무      A         167.9  50.2
4  김소혜 여자   23  3     무      O         176.1  53.5
5  서태웅 남자   24  4     무      B         176.1  79.8
6  정대만 남자   24  2     유      B         175.2  61.7
7  이정환 남자   22  4     무      B         169.1  69.8
8  강백호 남자   23  3     무      O         165.5  68.5
9  전소미 여자   22  2     유      O         161.9  52.3
10 변덕규 남자   21  1     무      A         163.2  55.5
11 정채연 여자   22  2     무      B         157.8  44.9
12 권준호 남자   24  4     유      O         166.9  61.7
13 김세정 여자   21  1     무      O         155.5  44.9
14 신준섭 남자   23  1     무      A         168.9  62.7

### "LIKE" 연산자

* 특정 문자 시작, 끝, 포함하는 값을 추출

In [25]:
sqldf("SELECT * FROM TB WHERE Weight LIKE '5%'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 최유정 여자   23  1     유      A         177.1  54.9
2 이한나 여자   20  1     무      A         167.9  50.2
3 김소혜 여자   23  3     무      O         176.1  53.5
4 채소연 여자   22  2     유      AB        169.9  52.7
5 전소미 여자   22  2     유      O         161.9  52.3
6 변덕규 남자   21  1     무      A         163.2  55.5

In [26]:
sqldf("SELECT * FROM TB WHERE Weight LIKE '7%'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 서태웅 남자   24  4     무      B         176.1  79.8
2 윤대협 남자   22  2     유      AB        180.3  76.2

In [28]:
sqldf("SELECT * FROM TB WHERE Weight LIKE '%9'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 정채연 여자   22  2     무      B         157.8  44.9
4 채치수 남자   23  3     무      AB        181.8  85.9
5 김세정 여자   21  1     무      O         155.5  44.9

In [30]:
sqldf("SELECT * FROM TB WHERE Weight LIKE '%2'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 이한나 여자   20  1     무      A         167.9  50.2
2 윤대협 남자   22  2     유      AB        180.3  76.2

In [31]:
sqldf("SELECT * FROM TB WHERE Name LIKE '김%'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 김소혜 여자   23  3     무      O         176.1  53.5
2 김세정 여자   21  1     무      O         155.5  44.9

In [32]:
sqldf("SELECT * FROM TB WHERE Name LIKE '%정'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 최유정 여자   23  1     유      A         177.1  54.9
2 김세정 여자   21  1     무      O         155.5  44.9

In [33]:
sqldf("SELECT * FROM TB WHERE Name LIKE '%소%'")

  Name   Gender Age Grade Picture BloodType Height Weight
1 김소혜 여자   23  3     무      O         176.1  53.5
2 채소연 여자   22  2     유      AB        169.9  52.7
3 전소미 여자   22  2     유      O         161.9  52.3

### 6) "GROUP BY" 연산자

* 중복값을 제외하고 1개의 고유값만 출력

In [34]:
sqldf("SELECt Grade FROM TB GROUP By Grade")

  Grade
1 1
2 2
3 3
4 4

### 7) "SUM()" 연산

In [35]:
sqldf("SELECT Grade, SUM(Age), SUM(Height), SUM(Weight)
        FROM TB GROUP BY Grade")

  Grade SUM(Age) SUM(Height) SUM(Weight)
1 1     108      832.6       268.2
2 2     112      845.1       287.8
3 3      90      702.5       271.8
4 4      70      512.1       211.3

### 8) "AVG()" 연산

In [36]:
sqldf("SELECT Grade, AVG(Age), AVG(Height), AVG(Weight)
          FROM TB GROUP BY Grade")

  Grade AVG(Age) AVG(Height) AVG(Weight)
1 1     21.60000 166.520     53.64000
2 2     22.40000 169.020     57.56000
3 3     22.50000 175.625     67.95000
4 4     23.33333 170.700     70.43333

### 9) "HAVING" 연산자

In [38]:
sqldf("SELECT Grade, AVG(Age), AVG(Height), AVG(Weight)
          FROM TB
          GROUP BY Grade
          HAVING AVG(Height) > 170")

  Grade AVG(Age) AVG(Height) AVG(Weight)
1 3     22.50000 175.625     67.95000
2 4     23.33333 170.700     70.43333

### 10) "ORDER BY" 연산자

* 오름차순 : ASC, 내림차순 : DESC

In [39]:
sqldf("SELECT * FROM TB WHERE Height > 170")

  Name   Gender Age Grade Picture BloodType Height Weight
1 송태섭 남자   21  3     무      B         179.1  63.9
2 최유정 여자   23  1     유      A         177.1  54.9
3 김소혜 여자   23  3     무      O         176.1  53.5
4 서태웅 남자   24  4     무      B         176.1  79.8
5 정대만 남자   24  2     유      B         175.2  61.7
6 채치수 남자   23  3     무      AB        181.8  85.9
7 윤대협 남자   22  2     유      AB        180.3  76.2

* Height 기준

In [40]:
sqldf("SELECT * FROM TB WHERE Height > 170 ORDER BY Height ASC")

  Name   Gender Age Grade Picture BloodType Height Weight
1 정대만 남자   24  2     유      B         175.2  61.7
2 김소혜 여자   23  3     무      O         176.1  53.5
3 서태웅 남자   24  4     무      B         176.1  79.8
4 최유정 여자   23  1     유      A         177.1  54.9
5 송태섭 남자   21  3     무      B         179.1  63.9
6 윤대협 남자   22  2     유      AB        180.3  76.2
7 채치수 남자   23  3     무      AB        181.8  85.9

In [41]:
sqldf("SELECT * FROM TB WHERE Height > 170 ORDER BY Height DESC")

  Name   Gender Age Grade Picture BloodType Height Weight
1 채치수 남자   23  3     무      AB        181.8  85.9
2 윤대협 남자   22  2     유      AB        180.3  76.2
3 송태섭 남자   21  3     무      B         179.1  63.9
4 최유정 여자   23  1     유      A         177.1  54.9
5 김소혜 여자   23  3     무      O         176.1  53.5
6 서태웅 남자   24  4     무      B         176.1  79.8
7 정대만 남자   24  2     유      B         175.2  61.7

* Weight 기준

In [42]:
sqldf("SELECT * FROM TB WHERE Height > 170 ORDER BY Weight ASC")

  Name   Gender Age Grade Picture BloodType Height Weight
1 김소혜 여자   23  3     무      O         176.1  53.5
2 최유정 여자   23  1     유      A         177.1  54.9
3 정대만 남자   24  2     유      B         175.2  61.7
4 송태섭 남자   21  3     무      B         179.1  63.9
5 윤대협 남자   22  2     유      AB        180.3  76.2
6 서태웅 남자   24  4     무      B         176.1  79.8
7 채치수 남자   23  3     무      AB        181.8  85.9

In [44]:
sqldf("SELECT * FROM TB WHERE Height > 170 ORDER BY Weight DESC")

  Name   Gender Age Grade Picture BloodType Height Weight
1 채치수 남자   23  3     무      AB        181.8  85.9
2 서태웅 남자   24  4     무      B         176.1  79.8
3 윤대협 남자   22  2     유      AB        180.3  76.2
4 송태섭 남자   21  3     무      B         179.1  63.9
5 정대만 남자   24  2     유      B         175.2  61.7
6 최유정 여자   23  1     유      A         177.1  54.9
7 김소혜 여자   23  3     무      O         176.1  53.5

### 11) "AS" 연산자

* 출력 Column Name 변경

In [45]:
sqldf("SELECT SUM(Height) AS SUM_Height FROM TB")

  SUM_Height
1 2892.3

In [46]:
sqldf("SELECT AVG(Height) AS AVG_Height, AVG(Weight) AS AVG_Weight
        FROM TB")

  AVG_Height AVG_Weight
1 170.1353   61.12353